#Final_paper1

Условие задачи:
Написать программу, которая из имеющегося массива строк формирует массив из строк, 
длина которых меньше или равна 3 символа. 

Описание решения:

Для решения поставленной задачи воспользуемся тремя методами.
Первый метода будет создавать и возвращать массив из строк, путём ввода пользователем с клавиатуры.
Размер и количество индексов необходимых для ввода будет определять переменная "size".
Значение переменной будет определенно пользователем при помощи ввода с клавиатуры, после запроса программы в консоле. Иначе говоря, будет задан размер будующего массива данных.
После вовода пользователем необходимого количества строк, полученый массив строк будет вывден в консоль специально предназначенным для этого методом. 
Следующим шагом выполнения условия задачи будет, написание метода, который будет получать, заданый пользователем массив из строк. Метод специальным условием выбирает строки состоящие из трёх или меньше символов и записывает их в новый массив. Метод позволяет сраузу выводить новый массив в консоль.
Получив три метода, переходим к объявлению переменных и вызову методов.
Переменную "size" будем запрашивать и вводить через консоль.
Для удобства написания и лаконичности кода, объявим новый массив, который будет хранить в себе массив строк, введённых пользователем.
Для наглядности происходящего, разделим этапы ввода и вывода данных специльными оповещающими сообщениями в консоль. Результат вычисления выполняющий условие задачи, так же выведем в консоль с сопровождением специального сообщения.


МЕТОД ВВОДА ДАННЫХ:

string[] CreateStringArr(int size) // Метод объявления массива состоящего из строк.
{
    string[] array = new string[size]; // Объявление массива хранящего введённые пользователем строки.
    for (int i = 0; i < array.Length; i++) 
    {
        array[i] = Console.ReadLine(); // Ввод осуществляется через консоль, вручную.
        if (array[i] == "") // Условие, если пользователь пропустил ввод слова.
        {
            array[i] = "empty_index"; // Выводит в консоль вместо пропущенной строки
        }
    }
    return array; // возвращает массив с введёнными строками
}

МЕТОД СОРТИРОВКИ СТРОК ПО УСЛОВИЮ ЗАДАЧИ:

void threeLetter(string[] array) // Метод вывода нового массива, состоящего из индексов удовлетворяющих условие задачи.
{
    Console.Write("This is the new array from three or less letters in a word: [ "); // Оповещение для удобства восприятия информации с консоли
    for (int i = 0; i < array.Length; i++) 
    {
        if (array[i].Length <= 3) Console.Write($"{array[i]} "); // Услвие позволяющее отсаритровывать массив. 
    }
    Console.Write("]");
}

МЕТОД ВЫВОДА МАССИВА В КОНСОЛЬ.
void ShowArray(string[] array) // Метод вывода массива в консоль.
{
    Console.Write("[ ");
    for (int i = 0; i < array.Length; i++) // Каждую итерацию в консоль вывыодиться инедкс массива переданого методу.
    {
        Console.Write(array[i] + " ");
    }
    Console.Write("]");
    Console.WriteLine();
}

Console.WriteLine("Enter the size of the array."); // Сообщение о начале выполнения программы и приглашение для ввода данных.
int size = Convert.ToInt32(Console.ReadLine()); // Переменная размера массива вводных данных.
Console.WriteLine($"Enter the any {size} words or symbols:"); // Собщение в консоле, с просьбой пользователя ввести количество строк в консоль.
string[] someArray = CreateStringArr(size); // Дополнительный массив упрощающий визуальное восприятие, и упрощающее написание кода.
Console.WriteLine($"It is the entered array:"); // Сообщение для удобства восприятия.
ShowArray(someArray); // Вывод в консоль массива введённых данных с клавиатуры.
threeLetter(someArray); // Вызов метода, выводящего в консоль изменённый массив, удовлетворяющий условие задачи.
